spec/fixtures/files/stripe/charge_successful_3d_secure.json

{
  "id": "ch_1DsniAHwuhGySQCd9goxQM8r",
  "object": "charge",
  "amount": 360,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "application_fee_amount": null,
  "balance_transaction": "txn_1DsniBHwuhGySQCdiAfGc7ob",
  "captured": true,
  "created": 1547542554,
  "currency": "usd",
  "customer": "cus_ELUhTs2OB6Zh3x",
  "description": null,
  "destination": null,
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {},
  "invoice": null,
  "livemode": false,
  "metadata": {},
  "on_behalf_of": null,
  "order": null,
  "outcome": {"network_status":"approved_by_network","reason":null,"risk_level":"normal","risk_score":25,"rule":"allow_if_3ds_authenticated_liability_shift","seller_message":"Payment complete.","type":"authorized"},
  "paid": true,
  "payment_intent": null,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_1DsniAHwuhGySQCd9goxQM8r/refunds"},
  "review": null,
  "shipping": null,
  "source": {"id":"src_1Dsni4HwuhGySQCdrVb9WMOV","object":"source","amount":360,"client_secret":"src_client_secret_ELUhd8DopmO19aLGRD6JCcnM","created":1547542555,"currency":"usd","flow":"redirect","livemode":false,"metadata":{},"owner":{"address":{"city":null,"country":null,"line1":"","line2":null,"postal_code":null,"state":null},"email":null,"name":null,"phone":null,"verified_address":null,"verified_email":null,"verified_name":null,"verified_phone":null},"redirect":{"failure_reason":null,"return_url":"http://127.0.0.1:54921/users/threedsecure_create","status":"succeeded","url":"https://hooks.stripe.com/redirect/authenticate/src_1Dsni4HwuhGySQCdrVb9WMOV?client_secret=src_client_secret_ELUhd8DopmO19aLGRD6JCcnM"},"statement_descriptor":null,"status":"consumed","three_d_secure":{"card":"src_1Dsni1HwuhGySQCd2CCCAf9L","brand":"Visa","country":"US","cvc_check":"pass","exp_month":5,"exp_year":2022,"fingerprint":"nzH1WYKwGPJtfUhD","funding":"credit","last4":"3063","three_d_secure":"required","authenticated":true,"customer":null,"name":null,"address_line1_check":null,"address_zip_check":null,"tokenization_method":null,"dynamic_last4":null},"type":"three_d_secure","usage":"single_use"},
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}
