spec/fixtures/files/stripe/customer.json

{
  "id": "cus_ELE17RRqbrH5tx",
  "object": "customer",
  "account_balance": 0,
  "created": 1547480482,
  "currency": null,
  "default_source": "src_1DsXYzHwuhGySQCdA3JqCr6T",
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": "test@example.com",
  "invoice_prefix": "7A12D10",
  "livemode": false,
  "metadata": {},
  "shipping": null,
  "sources": {"object":"list","data":[{"id":"src_1DsXYzHwuhGySQCdA3JqCr6T","object":"source","amount":null,"card":{"exp_month":5,"exp_year":2022,"brand":"Visa","country":"US","cvc_check":"pass","fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","last4":"4242","three_d_secure":"optional","name":null,"address_line1_check":null,"address_zip_check":null,"tokenization_method":null,"dynamic_last4":null},"client_secret":"src_client_secret_ELE1BcnA3sxenLRFkRLeW0Lv","created":1547480481,"currency":null,"customer":"cus_ELE17RRqbrH5tx","flow":"none","livemode":false,"metadata":{},"owner":{"address":null,"email":null,"name":null,"phone":null,"verified_address":null,"verified_email":null,"verified_name":null,"verified_phone":null},"statement_descriptor":null,"status":"chargeable","type":"card","usage":"reusable"}],"has_more":false,"total_count":1,"url":"/v1/customers/cus_ELE17RRqbrH5tx/sources"},
  "subscriptions": {"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/customers/cus_ELE17RRqbrH5tx/subscriptions"},
  "tax_info": null,
  "tax_info_verification": null
}
