spec/fixtures/files/stripe/subscription_1_month_trial.json

{
  "id": "sub_ELUhjBpnwTtNF4",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1550220951,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1547542556,
  "current_period_end": 1550220951,
  "current_period_start": 1547542556,
  "customer": "cus_ELUhTs2OB6Zh3x",
  "days_until_due": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {"object":"list","data":[{"id":"si_ELUhwfQMF3mKa5","object":"subscription_item","created":1547542556,"metadata":{},"plan":{"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"subscription":"sub_ELUhjBpnwTtNF4"}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_ELUhjBpnwTtNF4"},
  "livemode": false,
  "metadata": {},
  "plan": {"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},
  "quantity": 1,
  "start": 1547542556,
  "status": "trialing",
  "tax_percent": null,
  "trial_end": 1550220951,
  "trial_start": 1547542556
}
